artillery_getAll.yml
config:
  # target: "http://54.175.93.124:3000"
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: Warm up
    - duration: 180
      arrivalRate: 100
      rampTo: 500
      name: Ramp high load
    # Uber high load settings
    # - duration: 180
    #   arrivalRate: 500
    #   rampTo: 1000
    #   name: Sustained uber high load
    - duration: 180
      arrivalRate: 500
      rampTo: 3000
      name: Sustained uber high load

scenarios:
  - name: "Retrieve product review"
    flow:
      - get:
          url: '/reviews'
          qs:
            sort: 'newest'
            product_id: 10111
            count: 100
      - get:
          url: '/reviews/meta'
          qs:
            product_id: 10111